{
    "welcome": {
        "title": "ยินดีต้อนรับ!"
    },
    "login": {
        "subtitle": "น้องปันยาอยากช่วยคุณ!",
        "loginButton": "เข้าสู่ระบบ"
    },
    "dashboard": {
        "title": "ยา",
        "currentStock": "สต็อกยาปัจจุบัน",
        "topDispensed": "ยาที่จ่ายมากที่สุด 5 อันดับตลอดกาล",
        "medicineId": "รหัสยา",
        "image": "รูปภาพ",
        "name": "ชื่อ",
        "inStock": "ในสต็อก",
        "actions": "การดำเนินการ",
        "add": "เพิ่ม",
        "edit": "แก้ไข"
    },
    "form": {
        "title": "Nongpanya",
        "subtitle": "Your Friendly Medical Assistant",
        "warning": "สำหรับอาการเล็กน้อยเท่านั้น หากอาการรุนแรงหรือไม่หายไป กรุณาไปที่ HCU",
        "name": "ชื่อของคุณ",
        "email": "อีเมลของคุณ",
        "phone": "เบอร์โทรของคุณ",
        "allergies": "อาการแพ้ (ถ้ามี)",
        "allergiesPlaceholder": "เช่น เพนิซิลลิน แอสไพริน",
        "symptoms": "เลือกอาการของคุณ",
        "medicines": "เลือกยา",
        "additionalNotes": "หมายเหตุเพิ่มเติม",
        "additionalNotesPlaceholder": "ข้อมูลอื่นๆ ที่คุณต้องการแชร์...",
        "termsAccept": "ฉันยอมรับข้อกำหนดและเงื่อนไข",
        "submit": "ส่ง",
        "pleaseAcceptTerms": "กรุณายอมรับข้อกำหนดและเงื่อนไข",
        "invalidQR": "QR Code ไม่ถูกต้อง กรุณาลองใหม่อีกครั้ง",
        "limitReached": "คุณได้ถึงขีดจำกัดการส่งแล้ว",
        "submitError": "เกิดข้อผิดพลาดในการส่งข้อมูล กรุณาลองใหม่อีกครั้ง",
        "connectionError": "ไม่สามารถเชื่อมต่อได้ กรุณาตรวจสอบการเชื่อมต่ออินเทอร์เน็ตและลองใหม่อีกครั้ง"
    },
    "result": {
        "title": "ยาของคุณ",
        "subtitle": "กรุณาอ่านคำแนะนำทั้งหมดอย่างระมัดระวัง",
        "monthlyQuota": "โควต้ารายเดือน",
        "used": "ใช้แล้ว",
        "remaining": "เหลือ",
        "resetsOn": "รีเซ็ตในวันที่",
        "quantity": "จำนวน",
        "instructions": "คำแนะนำ:",
        "warnings": "คำเตือน:",
        "representativeImage": "รูปภาพตัวอย่าง",
        "emergencyTitle": "ในกรณีฉุกเฉิน:",
        "emergencyContact": "ติดต่อ HCU: 1234 หรือไปโรงพยาบาลที่ใกล้ที่สุด",
        "backToHome": "กลับสู่หน้าหลัก",
        "noMedicines": {
            "title": "ไม่มียาที่เหมาะสม",
            "message": "เราไม่สามารถหายาที่เหมาะสมกับอาการของคุณในขณะนี้",
            "reasons": {
                "allergies": "ยาถูกแยกออกเนื่องจากการแพ้ที่คุณระบุไว้",
                "outOfStock": "ยาที่มีอยู่หมดสต็อกในขณะนี้",
                "noMatch": "ไม่มียาที่ตรงกับอาการที่คุณเลือก"
            },
            "backHome": "กลับสู่หน้าหลัก"
        }
    },
    "screen": {
        "welcome": {
            "title": "Nongpanya",
            "subtitle": "Your Friendly Medical Assistant",
            "pressToStart": "กดเพื่อเริ่มต้น",
            "logout": "ออกจากระบบ"
        },
        "pin": {
            "title": "เข้าสู่ระบบหน้าจอ",
            "subtitle": "ป้อนรหัสผ่านสำหรับ screen@mail.com",
            "error": "รหัสผ่านไม่ถูกต้อง กรุณาลองใหม่อีกครั้ง",
            "attempts": "ครั้งที่เหลือ",
            "clear": "CLR",
            "backspace": "⌫",
            "enter": "ยืนยัน",
            "authenticating": "กำลังตรวจสอบ...",
            "show": "แสดง",
            "hide": "ซ่อน",
            "info": "หน้าจอนี้สำหรับเจ้าหน้าที่ที่ได้รับอนุญาตเท่านั้น",
            "locked": {
                "title": "ระบบถูกล็อค",
                "subtitle": "กรุณารอ",
                "message": "ป้อนรหัสผิดหลายครั้งเกินไป กรุณารอ"
            }
        },
        "qrcode": {
            "title": "สแกน QR Code",
            "subtitle": "เพื่อดำเนินการต่อบนอุปกรณ์มือถือของคุณ"
        },
        "giving": {
            "title": "กำลังจ่ายยา",
            "subtitle": "กรุณารอสักครู่ในขณะที่เรากำลังเตรียมยาของคุณ"
        },
        "complete": {
            "title": "ขอบคุณ!",
            "subtitle": "กรุณาตรวจสอบโทรศัพท์ของคุณสำหรับคำแนะนำการใช้ยา",
            "message": "ยาของคุณได้รับการจ่ายเรียบร้อยแล้ว"
        }
    },
    "loading": {
        "title": "กำลังประมวลผล...",
        "subtitle": "กรุณารอสักครู่ในขณะที่เรากำลังวิเคราะห์อาการของคุณ",
        "errors": {
            "sendingData": "เกิดข้อผิดพลาดในการส่งข้อมูล กรุณาลองใหม่อีกครั้ง",
            "serverError": "เกิดข้อผิดพลาดจากเซิร์ฟเวอร์",
            "unknown": "เกิดข้อผิดพลาดที่ไม่ทราบสาเหตุ",
            "emptyResponse": "ไม่ได้รับการตอบกลับจากเซิร์ฟเวอร์",
            "invalidResponse": "รูปแบบการตอบกลับจากเซิร์ฟเวอร์ไม่ถูกต้อง",
            "invalidData": "ข้อมูลที่ได้รับไม่ถูกต้อง",
            "noMedicines": "ไม่มียาที่เหมาะสมกับอาการของคุณ",
            "unexpected": "เกิดข้อผิดพลาดที่ไม่คาดคิด กรุณาลองใหม่อีกครั้ง",
            "connectionError": "การเชื่อมต่อขาดหาย กรุณาตรวจสอบการเชื่อมต่ออินเทอร์เน็ตและลองใหม่อีกครั้ง"
        }
    },
    "homepage": {
        "dashboard": "แดชบอร์ด",
        "signOut": "ออกจากระบบ",
        "monthlyQuota": "โควต้ารายเดือน",
        "used": "ใช้แล้ว",
        "remaining": "เหลือ",
        "limit": "จำกัดต่อเดือน",
        "resetsOn": "รีเซ็ตเมื่อ",
        "recentHistory": "ประวัติการขอยาล่าสุด",
        "noHistory": "ไม่พบข้อมูลการขอยา",
        "code": "รหัส",
        "symptoms": "อาการ",
        "medicines": "ยา",
        "status": "สถานะ",
        "date": "วันที่",
        "actions": "การดำเนินการ",
        "view": "ดู",
        "viewAllHistory": "ดูประวัติทั้งหมด",
        "back": "กลับ",
        "searchPlaceholder": "ค้นหาด้วยรหัส...",
        "all": "ทั้งหมด",
        "completed": "เสร็จสิ้น",
        "pending": "รอดำเนินการ",
        "dateRange": "ช่วงวันที่",
        "startDate": "วันที่เริ่มต้น",
        "endDate": "วันที่สิ้นสุด",
        "clearDates": "ล้างวันที่",
        "notes": "หมายเหตุ",
        "allergies": "แพ้ยา",
        "availableMedicines": {
            "title": "ยาที่มีในตู้จำหน่ายยา",
            "noMedicines": "ไม่มียาในระบบขณะนี้",
            "available": "พร้อมให้บริการ",
            "outOfStock": "สินค้าหมด",
            "clickForDetails": "คลิกเพื่อดูรายละเอียด",
            "guidelines": {
                "title": "แนวทางความปลอดภัยในการใช้ยา",
                "point1": "ยาเหล่านี้เหมาะสำหรับอาการเบื้องต้นและการใช้งานระยะสั้นเท่านั้น",
                "point2": "อ่านข้อมูลยาอย่างละเอียดก่อนใช้เสมอ",
                "point3": "ห้ามใช้ยาเกินขนาดหรือระยะเวลาที่แนะนำ",
                "point4": "ปรึกษาแพทย์หากอาการไม่ดีขึ้นหรือแย่ลง"
            },
            "notice": {
                "title": "ประกาศทางการแพทย์ที่สำคัญ",
                "description": "ยาที่แสดงที่นี่มีให้บริการในตู้จำหน่ายยาของเราสำหรับอาการเบื้องต้นทั่วไป ระบบนี้ไม่ใช่การทดแทนคำแนะนำทางการแพทย์จากผู้เชี่ยวชาญ สำหรับอาการรุนแรง การแพ้ยา หรือหากอาการไม่ดีขึ้น กรุณาพบแพทย์ทันที"
            }
        }
    },
    "medicineModal": {
        "title": "ข้อมูลยา",
        "available": "พร้อมให้บริการ",
        "description": "รายละเอียด",
        "generalGuidelines": {
            "title": "แนวทางการใช้ยาทั่วไป",
            "point1": "รับประทานตามคำแนะนำบนบรรจุภัณฑ์หรือตามคำแนะนำของผู้เชี่ยวชาญทางการแพทย์",
            "point2": "ห้ามใช้ยาเกินขนาดที่แนะนำ",
            "point3": "เก็บในที่เย็นและแห้ง หลีกเลี่ยงแสงแดดโดยตรง"
        }
    },
    "userLog": {
        "title": "บันทึกผู้ใช้",
        "subtitle": "ดูกิจกรรมและการส่งข้อมูลของผู้ใช้"
    },
    "symptoms": {
        "diarrhea": "ท้องเสีย",
        "bloating": "ท้องอืด",
        "headache": "ปวดหัว",
        "fever": "ไข้",
        "toothache": "ปวดฟัน",
        "menstrualPain": "ปวดประจำเดือน",
        "backShoulderMuscleJointPain": "ปวดหลัง/ไหล่/กล้ามเนื้อ/ข้อต่อ",
        "musclePain": "ปวดกล้ามเนื้อ",
        "tremors": "สั่น (โรคพาร์กินสัน)"
    },
    "detail": {
        "1": "รับประทานขณะท้องว่างประมาณ 1-2 ชั่วโมงก่อนหรือหลังอาหาร",
        "2": "สามารถรับประทานได้ 2 ชั่วโมงก่อนหรือหลังยาอื่นๆ",
        "3": "สามารถผสมกับน้ำในอัตราส่วนที่เหมาะสมสำหรับเด็กรับประทาน",
        "4": "ดื่มน้ำหลังรับประทานยา",
        "5": "ไม่ควรรับประทานยานี้พร้อมกับยาอื่นๆ",
        "6": "อาจทำให้อุจจาระเป็นสีดำ ซึ่งไม่เป็นอันตรายเพราะสีดำมาจากยา",
        "7": "อาจทำให้ท้องอืด ผายลม หรือไม่สบายท้องในบางคน ซึ่งเป็นผลปกติของยาที่ดูดซับสารพิษในร่างกาย",
        "8": "หากท้องเสียไม่ดีขึ้นภายใน 2-3 วันหลังรับประทานยา ให้ปรึกษาแพทย์",
        "9": "สตรีมีครรภ์หรือให้นมบุตร ผู้ที่เพิ่งผ่าตัด หรือผู้ที่มีโรคทางเดินอาหารควรปรึกษาแพทย์หรือเภสัชกรก่อนใช้",
        "10": "หลีกเลี่ยงการบริโภคผลิตภัณฑ์นม น้ำเชื่อม แอลกอฮอล์ หรืออาหารหมักดองหลังรับประทานยา",
        "11": "ไม่เหมาะสำหรับผู้ที่ได้รับสารพิษรุนแรง เช่น กรดหรือด่างเข้มข้น เนื่องจากอาจทำให้เป็นกลางได้ยาก",
        "12": "การใช้เกินขนาดอาจทำให้ท้องผูก",
        "13": "การใช้เกินขนาดอาจทำให้กระหายน้ำมาก",
        "14": "ในกรณีรุนแรง การใช้เกินขนาดอาจทำให้ลำไส้อุดตัน",
        "15": "พาราเซตามอลสามารถรับประทานก่อนหรือหลังอาหารได้",
        "16": "ขนาดยาควรเหมาะสมกับน้ำหนักตัว",
        "17": "รับประทานห่างกันอย่างน้อย 4-6 ชั่วโมง และไม่เกิน 8 เม็ด (4,000 มก.) ต่อวันในรูปแบบ 500 มก.",
        "18": "ดื่มน้ำหลังรับประทานยา",
        "19": "หากลืมรับประทานยา ให้รับประทานทันทีที่จำได้โดยไม่เพิ่มขนาดยาเป็นสองเท่าสำหรับการรับประทานครั้งต่อไป",
        "20": "หากไข้ไม่ลดลงภายใน 3 วันของการใช้ ให้ปรึกษาแพทย์เพื่อการวินิจฉัยเพิ่มเติม",
        "21": "ไม่ควรรับประทานยาต่อเนื่องเกิน 5 วัน หากอาการยังคงอยู่ ให้ปรึกษาแพทย์เพื่อการวินิจฉัยเพิ่มเติม",
        "22": "หลีกเลี่ยงการใช้ยานี้ร่วมกับผลิตภัณฑ์อื่นที่มีพาราเซตามอล เนื่องจากอาจทำให้เกินขนาด",
        "23": "หากเกิดอาการแพ้ เช่น ผื่นคัน บวมที่ใบหน้า เปลือกตา หรือริมฝีปาก ลมพิษ เวียนศีรษะ หรือหายใจลำบาก ให้ไปพบแพทย์ทันที",
        "24": "ผู้ที่ดื่มแอลกอฮอล์เป็นประจำหรือมีโรคตับและไตควรปรึกษาแพทย์หรือเภสัชกรก่อนใช้",
        "25": "ไม่ควรรับประทานยาหากไม่มีอาการที่ระบุไว้",
        "26": "การใช้เกินขนาด (มากกว่า 150 มก./กก. ของน้ำหนักตัว) อาจทำให้คลื่นไส้",
        "27": "การใช้เกินขนาดอาจทำให้อาเจียน",
        "28": "การใช้เกินขนาดอาจทำให้ง่วงนอนและความดันโลหิตต่ำ",
        "29": "การใช้เกินขนาดอาจทำให้การทำงานของตับและไตบกพร่อง"
    },
    "medicineDescription": {
        "1": "ถ่านกัมมันต์ 260 มก. ใช้รักษาอาการท้องเสีย ท้องอืด และดูดซับสารพิษในระบบทางเดินอาหาร",
        "2": "พาราเซตามอล 500 มก. ใช้ลดไข้และบรรเทาอาการปวดทั่วไป เช่น ปวดหัว เหมาะสำหรับผู้ใหญ่และเด็กอายุ 12 ปีขึ้นไป",
        "3": "ออร์เฟนาดรีน 35 มก. และพาราเซตามอล 450 มก. ใช้บรรเทาอาการปวดกล้ามเนื้อในบริเวณต่างๆ เช่น คอ ขา และหลัง ที่เกิดจากความตึงเครียดของกล้ามเนื้อหรือการหดเกร็ง",
        "4": "เมเฟนามิก แอซิด 500 มก. ใช้บรรเทาอาการปวดประจำเดือนและอาการปวดปานกลางอื่นๆ เช่น ปวดฟัน",
        "5": "ชุดทำความสะอาดแผลขนาดเล็กพื้นฐานประกอบด้วยไอโอดีน แอลกอฮอล์ และพลาสเตอร์ปิดแผล"
    }
}